

&НаКлиенте
Процедура ПриИзмененииСкидки(Элемент)  
// ++ Симбирцева Задать вопрос при изменении скидки 26.12.2024	
	ЗадатьВопросАсинх_ПриИзменении();
// -- Симбирцева Задать вопрос при изменении скидки 26.12.2024		
КонецПроцедуры


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

//&НаКлиенте
//Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	//ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	//РассчитатьСуммуСтроки(ТекущиеДанные);
	
//КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

//&НаКлиенте
//Процедура УслугиСкидкаПриИзменении(Элемент)
	
	//ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	//РассчитатьСуммуСтроки(ТекущиеДанные);
	
//КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	// ++ Симбирцева 26.12.2024/
	//КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	// -- Симбирцева 26.12.2024/
	КоэффициентСкидки = 1 - Объект.ДЗ_СогласованнаяСкидка / 100;
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗадатьВопросАсинх_ПриИзменении()
// ++ Симбирцева Задать вопрос при изменении скидки 29.10.2024	
	Если  Объект.Услуги.Количество() <> 0 ИЛИ Объект.Товары.Количество() <> 0 Тогда  
		
		Обещание = ВопросАсинх(НСтр("ru='Изменен процент скидки. Пересчитать таблицы товаров и услуг?'"), РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Результат = Ждать обещание; 
		
		Если Результат = КодВозвратаДиалога.Да Тогда    
			
			ПересчетТаблиц();
		КонецЕсли;
	КонецЕсли;
// -- Симбирцева Задать вопрос при изменении скидки 29.10.2024	
КонецПроцедуры  

&НаКлиенте
Процедура ПересчетТаблиц()
	// ++ Симбирцева 25.10.2024	_Добавление процедуры ПересчитатьТаблицу	
	Для Каждого КаждойСтроки Из Объект.Услуги Цикл
		
		РассчитатьСуммуСтроки(КаждойСтроки);   
	КонецЦикла;
	Для Каждого КаждойСтроки Из Объект.Товары Цикл
		
		РассчитатьСуммуСтроки(КаждойСтроки);   
	КонецЦикла;
	// -- Симбирцева 25.10.2024	_Добавление процедуры ПересчитатьТаблицу
	
КонецПроцедуры




#Область ПодключаемыеКоманды

&НаКлиенте
Процедура ДЗ_ПересчитатьТаблицуПосле(Команда)
	// ++ Симбирцева 25.10.2024	_Добавление команды ПересчитатьТаблицу
	ПересчетТаблиц();
	// -- Симбирцева 25.10.2024	_Добавление команды ПересчитатьТаблицу	
КонецПроцедуры


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
