#Область ПрограммныйИнтерфейс   

Процедура ДополнитьФорму(Форма) Экспорт  
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма); 
		
		ДобавитьПолеВводаНаСервере(Форма);
		ДобавитьПрограммноКомандуНаСервере(Форма); 
		//////////++При изменении скидки - добавление обработчика
		Если Форма.Элементы.Найти("ДЗ_СогласованнаяСкидка") = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Форма.Элементы.ДЗ_СогласованнаяСкидка.УстановитьДействие("ПриИзменении", "ПриИзмененииСкидки");
		//////////--При изменении скидки - добавление обработчика
	
	
		
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);  
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеНаФормуПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеНаФормуПередСуммаДокумента(Форма); 
		
	КонецЕсли;
	
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс    

Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)   
	
	ПолеВВода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВВода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	
КонецПроцедуры  

Процедура ВставитьПолеКонтактноеНаФормуПередСуммаДокумента(Форма) 
	
	ПолеВВода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), ,Форма.Элементы.СуммаДокумента);
	ПолеВВода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
		
КонецПроцедуры 


Процедура ДобавитьПолеВводаНаСервере(Форма)	
// ++ Симбирцева 25.10.2024	_Добавление поле скидка
	
	// Проверка нужна, чтобы избежать ошибки при попытке создания элемента с одним и тем же именем несколько раз
	Если Форма.Элементы.Найти("ДЗ_СогласованнаяСкидка") = Неопределено Тогда
		// Вначале просто добавляем элемент в коллекцию Элементы
		НовыйЭлемент = Форма.Элементы.Добавить("ДЗ_СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаЛево);
	
		//Затем донастраиваем его и указываем нужные свойства
		НовыйЭлемент.ПутьКДанным = "Объект.ДЗ_СогласованнаяСкидка";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Согласованная скидка(ДЗ)";
	КонецЕсли;
// -- Симбирцева 25.10.2024	
КонецПроцедуры


Процедура ДобавитьПрограммноКомандуНаСервере(Форма)   



	Если Форма.Элементы.Найти("ПересчитатьТаблицу") = Неопределено Тогда
		//Добавим команду в коллекцию команд
		КомандаПересчитать = Форма.Команды.Добавить("ПересчитатьТаблицу_ДЗ");
		КомандаПересчитать.Заголовок = "Пересчитать таблицу";
		КомандаПересчитать.Действие = "ДЗ_ПересчитатьТаблицуПосле";
		
		КнопкаКоманды = Форма.Элементы.Добавить("ПересчитатьТаблицу", Тип("КнопкаФормы"),  Форма.Элементы.ГруппаШапкаЛево);
		КнопкаКоманды.ИмяКоманды = "ПересчитатьТаблицу_ДЗ";
		// Если помещаем просто на форму, то вид - обычная кнопка
		// Если укажем контейнер с типом Командная панель, то вид - КнопкаКоманднойПанели
		КнопкаКоманды.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	КонецЕсли;    


КонецПроцедуры


     
#КонецОбласти